::получаем curpath:
@for /f %%i in ("%0") do set curpath=%~dp0

::задаем основные переменные окружения
@CALL "%curpath%set_path.bat"
@echo ==================================================
@echo создаем временные и log каталоги:
mkdir "temp"
mkdir "temp/log_app"

@echo ==================================================
@echo установка зависимостей из package.json:
CALL npm install

@echo ==================================================
@echo установка внешних клиентских js библиотек (через bower):
CALL bower install

@echo ==================================================
@echo все
@pause