::получаем curpath:
@for /f %%i in ("%0") do set curpath=%~dp0

::задаем основные переменные окружения
@CALL "%curpath%set_path.bat"

:: ===========================================================================
:: уничтожаем уже запущенные процессы node
:: @taskkill /IM node.exe /f /T
@cls

:: ===========================================================================
:: запускаем наш процесс
node.exe server.js


:: ===========================================================================
:: конец
@pause
